[
    {
        "Id": "601c26f1-351d-4232-8de1-01529fcf9323",
        "Name": "Christmas pie",
        "url": "https://www.bbcgoodfood.com/recipes/2793/christmas-pie",
        "Description": "Combine a few key Christmas flavours here to make a pie that both children and adults will adore",
        "Author": "Mary Cadogan",
        "Ingredients": [
            "2 tbsp olive oil",
            "knob butter",
            "1 onion, finely chopped",
            "500g sausagemeat or skinned sausages",
            "grated zest of 1 lemon",
            "100g fresh white breadcrumbs",
            "85g ready-to-eat dried apricots, chopped",
            "50g chestnut, canned or vacuum-packed, chopped",
            "2 tsp chopped fresh or 1tsp dried thyme",
            "100g cranberries, fresh or frozen",
            "500g boneless, skinless chicken breasts",
            "500g pack ready-made shortcrust pastry",
            "beaten egg, to glaze"
        ],
        "Method": [
            "Heat oven to 190C/fan 170C/gas 5. Heat 1 tbsp oil and the butter in a frying pan, then add the onion and fry for 5 mins until softened. Cool slightly. Tip the sausagemeat, lemon zest, breadcrumbs, apricots, chestnuts and thyme into a bowl. Add the onion and cranberries, and mix everything together with your hands, adding plenty of pepper and a little salt.",
            "Cut each chicken breast into three fillets lengthwise and season all over with salt and pepper. Heat the remaining oil in the frying pan, and fry the chicken fillets quickly until browned, about 6-8 mins.",
            "Roll out two-thirds of the pastry to line a 20-23cm springform or deep loose-based tart tin. Press in half the sausage mix and spread to level. Then add the chicken pieces in one layer and cover with the rest of the sausage. Press down lightly.",
            "Roll out the remaining pastry. Brush the edges of the pastry with beaten egg and cover with the pastry lid. Pinch the edges to seal, then trim. Brush the top of the pie with egg, then roll out the trimmings to make holly leaf shapes and berries. Decorate the pie and brush again with egg.",
            "Set the tin on a baking sheet and bake for 50-60 mins, then cool in the tin for 15 mins. Remove and leave to cool completely. Serve with a winter salad and pickles."
        ]
    },
    {
        "Name": "Simmer-&-stir Christmas cake",
        "url": "https://www.bbcgoodfood.com/recipes/1160/simmerandstir-christmas-cake",
        "Description": "An easy-to-make alternative to traditional Christmas cakes which requires no beating",
        "Author": "Mary Cadogan",
        "Ingredients": [
            "175g butter, chopped",
            "200g dark muscovado sugar",
            "750g luxury mixed dried fruit (one that includes mixed peel and glacé cherries)",
            "finely grated zest and juice of 1 orange",
            "finely grated zest of 1 lemon",
            "100ml/3½ fl oz cherry brandy or brandy plus 4tbsp more",
            "85g macadamia nut",
            "3 large eggs, lightly beaten",
            "85g ground almond",
            "200g plain flour",
            "½ tsp baking powder",
            "1 tsp ground mixed spice",
            "1 tsp ground cinnamon",
            "¼ tsp ground allspice"
        ],
        "Method": [
            "Put the butter, sugar, fruit, zests, juice and 100ml/3½fl oz brandy in a large pan. Bring slowly to the boil, stirring until the butter has melted. Reduce the heat and bubble for 10 minutes, stirring occasionally.",
            "Remove the pan from the heat and leave to cool for 30 minutes.",
            "Meanwhile, preheat the oven to 150C/gas 2/ fan 130C and line a 20cm round cake tin. Toast the nuts in a dry frying pan, tossing them until evenly browned, or in the oven for 8-10 minutes - keep an eye on them as they burn easily. When they are cool, chop roughly. Stir the eggs, nuts and ground almonds into the fruit mixture and mix well. Sift the flour, baking powder and spices into the pan. Stir in gently, until there are no traces of flour left.",
            "Spoon the mixture into the tin and smooth it down evenly - you will find this is easiest with the back of a metal spoon which has been dipped into boiling water.",
            "Bake for 45 minutes, then turn down the heat to 140C/gas 1/ fan120C and cook for a further 1-1¼ hours (about a further 1¾ hours if you have a gas oven) until the cake is dark golden in appearance and firm to the touch. Cover the top of the cake with foil if it starts to darken too much. To check the cake is done, insert a fine skewer into the centre - if it comes out clean, the cake is cooked.",
            "Make holes all over the warm cake with a fine skewer and spoon the extra 4tbsp brandy over the holes until it has all soaked in. Leave the cake to cool in the tin. When it's cold, remove it from the tin, peel off the lining paper, then wrap first in baking parchment and then in foil. The cake will keep in a cupboard for up to three months or you can freeze it for six months."
        ],
        "Rating": 5
    }
]